Revit 2027 API
BuiltInFailures.StairRampFailures.RailingCurvesNotSplitStairs Property
 The slope of this railing may not parallel the stairs at runs and landings. To get a parallel railing, split the railing sketch at the ends of landings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RailingCurvesNotSplitStairs { get; }
Public Shared ReadOnly Property RailingCurvesNotSplitStairs As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RailingCurvesNotSplitStairs {
	FailureDefinitionId^ get ();
}
static member RailingCurvesNotSplitStairs : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace